name: "git"
backend: "python"
input [
  {
    name: "image"
    data_type: TYPE_FP32
    dims: [-1, -1, -1]
  }
]
output [
  {
    name: "generated_caption"
    data_type: TYPE_STRING
    dims: [-1]
  }
]